Revit 2027 API
SelectionChangedEventArgs.GetSelectedElements Method
 Returns ElementIds of selected elements.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetSelectedElements()
Public Function GetSelectedElements As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetSelectedElements()
member GetSelectedElements : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace